Ran Plan for 3 projects:

1. project: `SPA-adot-helia` dir: `SPA/SPA-adot/env/helia` workspace: `default`
1. project: `SPA-adot-production` dir: `SPA/SPA-adot/env/production` workspace: `default`
1. project: `SPA-adot-staging` dir: `SPA/SPA-adot/env/staging` workspace: `default`
---

### 1. project: `SPA-adot-helia` dir: `SPA/SPA-adot/env/helia` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running 'sh -c' '# Map environment to role ARN
if [ "helia" = "stage" ]; then
    ROLE_ARN="arn:aws:iam::569023477847:role/atlantis-cross-account-role-stage"
elif [ "helia" = "prod" ]; then
    ROLE_ARN="arn:aws:iam::569023477847:role/atlantis-cross-account-role-prod"
fi
# Assume the role and export temporary credentials
CREDS_JSON=$(aws sts assume-role --role-arn $ROLE_ARN --role-session-name atlantis-session-helia --query 'Credentials' --output json)
export AWS_ACCESS_KEY_ID=$(echo $CREDS_JSON | jq -r '.AccessKeyId')
export AWS_SECRET_ACCESS_KEY=$(echo $CREDS_JSON | jq -r '.SecretAccessKey')
export AWS_SESSION_TOKEN=$(echo $CREDS_JSON | jq -r '.SessionToken')
echo "Assumed role $ROLE_ARN successfully"
cd "$(dirname "$PROJECT_DIR")/../.."
rm -rf .terraform .terraform.lock.hcl
terraform init -backend-config="env/helia/helia.conf" -reconfigure -lock=false -input=false
terraform plan -compact-warnings -var-file="config/helia.tfvars" -lock-timeout=10m -out=$PLANFILE
' in '/home/atlantis/.atlantis/repos/RameezAhmedZaka/ECS-Atlantis/33/default/SPA/SPA-adot/env/helia': exit status 1: running "# Map environment to role ARN\nif [ \"helia\" = \"stage\" ]; then\n    ROLE_ARN=\"arn:aws:iam::569023477847:role/atlantis-cross-account-role-stage\"\nelif [ \"helia\" = \"prod\" ]; then\n    ROLE_ARN=\"arn:aws:iam::569023477847:role/atlantis-cross-account-role-prod\"\nfi\n# Assume the role and export temporary credentials\nCREDS_JSON=$(aws sts assume-role --role-arn $ROLE_ARN --role-session-name atlantis-session-helia --query 'Credentials' --output json)\nexport AWS_ACCESS_KEY_ID=$(echo $CREDS_JSON | jq -r '.AccessKeyId')\nexport AWS_SECRET_ACCESS_KEY=$(echo $CREDS_JSON | jq -r '.SecretAccessKey')\nexport AWS_SESSION_TOKEN=$(echo $CREDS_JSON | jq -r '.SessionToken')\necho \"Assumed role $ROLE_ARN successfully\"\ncd \"$(dirname \"$PROJECT_DIR\")/../..\"\nrm -rf .terraform .terraform.lock.hcl\nterraform init -backend-config=\"env/helia/helia.conf\" -reconfigure -lock=false -input=false\nterraform plan -compact-warnings -var-file=\"config/helia.tfvars\" -lock-timeout=10m -out=$PLANFILE\n" in "/home/atlantis/.atlantis/repos/RameezAhmedZaka/ECS-Atlantis/33/default/SPA/SPA-adot/env/helia": 
sh: aws: not found
sh: jq: not found
sh: jq: not found
sh: jq: not found
Assumed role  successfully
Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.
Initializing modules...
- my_bucket in modules/s3
- vpc in modules/vpc
Initializing provider plugins...
- Finding latest version of hashicorp/aws...
- Installing hashicorp/aws v6.34.0...
- Installed hashicorp/aws v6.34.0 (signed by HashiCorp)
Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
module.vpc.aws_vpc.this: Refreshing state... [id=vpc-0b5863d41f167221b]
module.my_bucket.aws_s3_bucket.this: Refreshing state... [id=network-helia-bucket11756]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # module.my_bucket.aws_s3_bucket.this will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "network-helia-bucket11756"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "us-east-1"
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "helia"
        }
      + tags_all                    = {
          + "Environment" = "helia"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
╷
│ Error: reading EC2 VPC (vpc-0b5863d41f167221b): operation error EC2: DescribeVpcs, https response error StatusCode: 403, RequestID: 7b3d954c-3010-4fc1-88d3-ee9397413f52, api error UnauthorizedOperation: You are not authorized to perform this operation. User: arn:aws:sts::569023477847:assumed-role/atlantis-task-role/fcfb79de044c41d89b46aaa709da6c3b is not authorized to perform: ec2:DescribeVpcs because no identity-based policy allows the ec2:DescribeVpcs action
│ 
│   with module.vpc.aws_vpc.this,
│   on modules/vpc/main.tf line 1, in resource "aws_vpc" "this":
│    1: resource "aws_vpc" "this" {
│ 
╵



```
</details>

---
### 2. project: `SPA-adot-production` dir: `SPA/SPA-adot/env/production` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running 'sh -c' '# Map environment to role ARN
if [ "production" = "stage" ]; then
    ROLE_ARN="arn:aws:iam::569023477847:role/atlantis-cross-account-role-stage"
elif [ "production" = "prod" ]; then
    ROLE_ARN="arn:aws:iam::569023477847:role/atlantis-cross-account-role-prod"
fi
# Assume the role and export temporary credentials
CREDS_JSON=$(aws sts assume-role --role-arn $ROLE_ARN --role-session-name atlantis-session-production --query 'Credentials' --output json)
export AWS_ACCESS_KEY_ID=$(echo $CREDS_JSON | jq -r '.AccessKeyId')
export AWS_SECRET_ACCESS_KEY=$(echo $CREDS_JSON | jq -r '.SecretAccessKey')
export AWS_SESSION_TOKEN=$(echo $CREDS_JSON | jq -r '.SessionToken')
echo "Assumed role $ROLE_ARN successfully"
cd "$(dirname "$PROJECT_DIR")/../.."
rm -rf .terraform .terraform.lock.hcl
terraform init -backend-config="env/production/prod.conf" -reconfigure -lock=false -input=false
terraform plan -compact-warnings -var-file="config/production.tfvars" -lock-timeout=10m -out=$PLANFILE
' in '/home/atlantis/.atlantis/repos/RameezAhmedZaka/ECS-Atlantis/33/default/SPA/SPA-adot/env/production': exit status 1: running "# Map environment to role ARN\nif [ \"production\" = \"stage\" ]; then\n    ROLE_ARN=\"arn:aws:iam::569023477847:role/atlantis-cross-account-role-stage\"\nelif [ \"production\" = \"prod\" ]; then\n    ROLE_ARN=\"arn:aws:iam::569023477847:role/atlantis-cross-account-role-prod\"\nfi\n# Assume the role and export temporary credentials\nCREDS_JSON=$(aws sts assume-role --role-arn $ROLE_ARN --role-session-name atlantis-session-production --query 'Credentials' --output json)\nexport AWS_ACCESS_KEY_ID=$(echo $CREDS_JSON | jq -r '.AccessKeyId')\nexport AWS_SECRET_ACCESS_KEY=$(echo $CREDS_JSON | jq -r '.SecretAccessKey')\nexport AWS_SESSION_TOKEN=$(echo $CREDS_JSON | jq -r '.SessionToken')\necho \"Assumed role $ROLE_ARN successfully\"\ncd \"$(dirname \"$PROJECT_DIR\")/../..\"\nrm -rf .terraform .terraform.lock.hcl\nterraform init -backend-config=\"env/production/prod.conf\" -reconfigure -lock=false -input=false\nterraform plan -compact-warnings -var-file=\"config/production.tfvars\" -lock-timeout=10m -out=$PLANFILE\n" in "/home/atlantis/.atlantis/repos/RameezAhmedZaka/ECS-Atlantis/33/default/SPA/SPA-adot/env/production": 
sh: aws: not found
sh: jq: not found
sh: jq: not found
sh: jq: not found
Assumed role  successfully
Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.
Initializing modules...
- my_bucket in modules/s3
- vpc in modules/vpc
Initializing provider plugins...
- Finding latest version of hashicorp/aws...
- Installing hashicorp/aws v6.34.0...
- Installed hashicorp/aws v6.34.0 (signed by HashiCorp)
Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
module.vpc.aws_vpc.this: Refreshing state... [id=vpc-009237435e416bef7]
module.my_bucket.aws_s3_bucket.this: Refreshing state... [id=network-prod-bucket71113]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # module.my_bucket.aws_s3_bucket.this will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "network-prod-bucket71113"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "us-east-1"
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "production"
        }
      + tags_all                    = {
          + "Environment" = "production"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
╷
│ Error: reading EC2 VPC (vpc-009237435e416bef7): operation error EC2: DescribeVpcs, https response error StatusCode: 403, RequestID: 8efb786a-6fd0-46be-969b-915070c3e901, api error UnauthorizedOperation: You are not authorized to perform this operation. User: arn:aws:sts::569023477847:assumed-role/atlantis-task-role/fcfb79de044c41d89b46aaa709da6c3b is not authorized to perform: ec2:DescribeVpcs because no identity-based policy allows the ec2:DescribeVpcs action
│ 
│   with module.vpc.aws_vpc.this,
│   on modules/vpc/main.tf line 1, in resource "aws_vpc" "this":
│    1: resource "aws_vpc" "this" {
│ 
╵



```
</details>

---
### 3. project: `SPA-adot-staging` dir: `SPA/SPA-adot/env/staging` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running 'sh -c' '# Map environment to role ARN
if [ "staging" = "stage" ]; then
    ROLE_ARN="arn:aws:iam::569023477847:role/atlantis-cross-account-role-stage"
elif [ "staging" = "prod" ]; then
    ROLE_ARN="arn:aws:iam::569023477847:role/atlantis-cross-account-role-prod"
fi
# Assume the role and export temporary credentials
CREDS_JSON=$(aws sts assume-role --role-arn $ROLE_ARN --role-session-name atlantis-session-staging --query 'Credentials' --output json)
export AWS_ACCESS_KEY_ID=$(echo $CREDS_JSON | jq -r '.AccessKeyId')
export AWS_SECRET_ACCESS_KEY=$(echo $CREDS_JSON | jq -r '.SecretAccessKey')
export AWS_SESSION_TOKEN=$(echo $CREDS_JSON | jq -r '.SessionToken')
echo "Assumed role $ROLE_ARN successfully"
cd "$(dirname "$PROJECT_DIR")/../.."
rm -rf .terraform .terraform.lock.hcl
terraform init -backend-config="env/staging/stage.conf" -reconfigure -lock=false -input=false
terraform plan -compact-warnings -var-file="config/stage.tfvars" -lock-timeout=10m -out=$PLANFILE
' in '/home/atlantis/.atlantis/repos/RameezAhmedZaka/ECS-Atlantis/33/default/SPA/SPA-adot/env/staging': exit status 1: running "# Map environment to role ARN\nif [ \"staging\" = \"stage\" ]; then\n    ROLE_ARN=\"arn:aws:iam::569023477847:role/atlantis-cross-account-role-stage\"\nelif [ \"staging\" = \"prod\" ]; then\n    ROLE_ARN=\"arn:aws:iam::569023477847:role/atlantis-cross-account-role-prod\"\nfi\n# Assume the role and export temporary credentials\nCREDS_JSON=$(aws sts assume-role --role-arn $ROLE_ARN --role-session-name atlantis-session-staging --query 'Credentials' --output json)\nexport AWS_ACCESS_KEY_ID=$(echo $CREDS_JSON | jq -r '.AccessKeyId')\nexport AWS_SECRET_ACCESS_KEY=$(echo $CREDS_JSON | jq -r '.SecretAccessKey')\nexport AWS_SESSION_TOKEN=$(echo $CREDS_JSON | jq -r '.SessionToken')\necho \"Assumed role $ROLE_ARN successfully\"\ncd \"$(dirname \"$PROJECT_DIR\")/../..\"\nrm -rf .terraform .terraform.lock.hcl\nterraform init -backend-config=\"env/staging/stage.conf\" -reconfigure -lock=false -input=false\nterraform plan -compact-warnings -var-file=\"config/stage.tfvars\" -lock-timeout=10m -out=$PLANFILE\n" in "/home/atlantis/.atlantis/repos/RameezAhmedZaka/ECS-Atlantis/33/default/SPA/SPA-adot/env/staging": 
sh: aws: not found
sh: jq: not found
sh: jq: not found
sh: jq: not found
Assumed role  successfully
Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.
Initializing modules...
- my_bucket in modules/s3
- vpc in modules/vpc
Initializing provider plugins...
- Finding latest version of hashicorp/aws...
- Installing hashicorp/aws v6.34.0...
- Installed hashicorp/aws v6.34.0 (signed by HashiCorp)
Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
module.vpc.aws_vpc.this: Refreshing state... [id=vpc-0ceddfcc480870477]
module.my_bucket.aws_s3_bucket.this: Refreshing state... [id=network-stage-bucket3345]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # module.my_bucket.aws_s3_bucket.this will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "network-stage-bucket3345"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "us-east-1"
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "staging"
        }
      + tags_all                    = {
          + "Environment" = "staging"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
╷
│ Error: reading EC2 VPC (vpc-0ceddfcc480870477): operation error EC2: DescribeVpcs, https response error StatusCode: 403, RequestID: 8518d16e-d4b9-4a9d-bc4f-15f325e26ff4, api error UnauthorizedOperation: You are not authorized to perform this operation. User: arn:aws:sts::569023477847:assumed-role/atlantis-task-role/fcfb79de044c41d89b46aaa709da6c3b is not authorized to perform: ec2:DescribeVpcs because no identity-based policy allows the ec2:DescribeVpcs action
│ 
│   with module.vpc.aws_vpc.this,
│   on modules/vpc/main.tf line 1, in resource "aws_vpc" "this":
│    1: resource "aws_vpc" "this" {
│ 
╵



```
</details>

---
### Plan Summary

3 projects, 0 with changes, 0 with no changes, 3 failed